using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Satelliteeducationsystem
{
    public partial class AboutSchool : Form
    {
        public AboutSchool()
        {
            InitializeComponent();
        }

        private void AboutSchool_Load(object sender, EventArgs e)
        {
            uiRichTextBox1.Text = "\t\t\t\t\t学校简介\r\n重庆工商大学派斯学院创办于1999年，2003年12月经教育部确认为全日制本科独立学院（教发函〔2003〕541号文件），是一所具有学士学位授予权的财经类普通本科高等学校。\r\n\r\n学校座落于中国历史文化名城——重庆市合川区城区，学校面向全国21个省（市、自治区）招生，全日制在校生14000余人。校园古朴典雅，环境怡人，具有深厚的历史文化底蕴。学校设有马克思主义学院、金融学院、管理学院、会计学院、文学与传媒学院、外国语学院、软件工程学院、数字经济学院等8个二级学院和1个基础教学部，本科专业37个，涵盖经济学、管理学、工学、文学四大学科门类，现已初步形成了以经济管理为依托，经济学、管理学、文学、工学等多学科交叉融合、协调发展的新型特色数字商科人才培养模式。\r\n\r\n学校现有教职工800余人。师资队伍结构合理，具有较强的教学科研能力，学科带头人有国务院特殊津贴获得者、重庆市学术技术带头人、重庆市中青年骨干教师等各级各类高层次人才。学科与专业建设稳步推进，工商管理为重庆市级重点培育学科，财务管理、金融学为重庆市一流本科专业，会计学、金融学、工商管理为重庆市级特色专业；财务管理、互联网金融、高级英语Ⅱ等10门课程获批重庆市级一流课程和一流外语在线开放课程；微观经济学、审计学、税法与纳税会计、金融学等10门课程获批重庆市高校课程思政示范课程。建成了数字经济产业、智联网研发、数字媒体、智慧会计、双碳智治与高质量发展、金融科技、跨境电商、乡村特色品牌、三农大数据、卢作孚研究等10个科研平台，科研水平稳步提高。\r\n\r\n学校办学设施齐全，拥有丰富的馆藏图书、电子数据库资源和完备的实验实训设施条件，建有先进的智能化商科综合实验实训中心、融媒体实验实训中心、智能工程实验实训中心、外语教学实训中心、公共体育健身实训中心等五大中心40个实验实训室，搭建了经管学科跨专业综合实践教学平台、金融大数据实训平台，建立起了“课程实训—阶段性实训—专业综合实训—跨专业综合实训”的多层级、多模块、跨专业的应用能力培养实践教学体系，先后与中工电业互联网有限公司、鹏盛会计师事务所、高顿教育科技有限公司、重庆芝诺大数据分析有限公司等150余个单位建立了校外实践教学基地。\r\n\r\n学校以党建引领全面推进“三全育人”综合改革，积极构建“十大育人”体系。学校金融学院学生一支部获批全国党建样板支部创建单位、软件工程学院学生第二党支部获批重庆市样板支部建设单位，网络育人项目入选重庆市民办高校“十大育人”精品项目，课程育人项目入选重庆市高校思想政治工作质量提升项目。学校的办学成就得到了政府和社会的高度评价和肯定，先后获得“重庆市学校社会力量办学先进单位”“重庆市安全文明校园”“全国最具品牌影响力独立学院”“重庆市平安校园”“全国民办教育先进单位”“重庆市平安校园反诈行活动示范学校”“重庆市法治宣传教育工作先进集体”“重庆市绿色学校建设示范学校”等荣誉称号。\r\n\r\n学校以教学为中心，建立健全了教学督导机制，教学质量和全面素质教育水平显著提升，应用型人才培养特色进一步凸显。近年来，学校师生在全国大学生广告艺术大赛、全国企业竞争模拟大赛、蓝桥杯全国软件和信息技术专业人才大赛、全国大学生数学建模竞赛等全国性大赛中获奖350余项。在全国大学生广告艺术大赛（重庆赛区）、全国大学生数学建模竞赛（重庆赛区）、重庆市大学生商科创新能力大赛等区域性赛事中获得市级以上奖项600余项。建校以来，学校为国家经济建设和社会发展输送了3.5万余名合格人才，多名优秀毕业生考入北京师范大学、四川大学、重庆大学、西南大学、香港岭南大学、墨尔本大学、昆士兰大学等国内外知名大学研究生学习深造。\r\n\r\n学校以生为本，大力开展素质拓展活动，着力培养学生健全人格，全面提高学生综合素质，卓有成效地推进了校园文化及和谐校园建设。学校打造了“濮悦菁年”“青榕计划”、科技文化艺术节、社团文化节等校园文化活动项目，学生广泛关注和热情参与，共同构建了和谐文明、富有挑战、敢于创新的育人环境。学校学生先后获得全国优秀共青团员、中国大学生自强之星、全国“返家乡”社会实践活动优秀学生、“双城青才校园先锋”个人、重庆青年志愿者优秀个人等荣誉。\r\n\r\n学校坚持以习近平新时代中国特色社会主义思想为指导，坚定社会主义办学方向，全面落实立德树人根本任务，秉承“应用立校、文化润校、特色兴校”的办学理念，遵循“崇实立信、经邦济民”的校训，不断深化教育教学改革，坚定不移地走内涵式发展道路，求真务实，开拓创新，正在朝着把学校建成办学特色鲜明、社会服务能力较强、优势突出的西部高水平应用型普通本科高校而努力奋斗。\r\n\r\n";
        }
    }
}
